powerfull/src/Documents/РеализацияАбонементов/РеализацияАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияАбонементов</name>
  <registerRecords>AccumulationRegister.ДеньгиОтПродажиУслугИАбонементов</registerRecords>
  <registerRecords>AccumulationRegister.ПродажаАбонементов</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОплаты</name>
    <type>
      <types>EnumRef.Оплата</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПродажаАбонементов</name>
    <attributes>
      <name>Абонемент</name>
      <type>
        <types>CatalogRef.Абонементы</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

powerfull/src/AccumulationRegisters/ПродажаАбонементов/ПродажаАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПродажаАбонементов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>CatalogRef.Абонементы</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

powerfull/src/AccumulationRegisters/ДеньгиОтПродажиУслугИАбонементов/ДеньгиОтПродажиУслугИАбонементов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДеньгиОтПродажиУслугИАбонементов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипДенежныхСредств</name>
    <type>
      <types>EnumRef.ТипДенежныхСредств</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

powerfull/src/Enums/Оплата/Оплата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Оплата</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Карта</name>
  </enumValues>
</mdclass:Enum>

powerfull/src/Enums/ТипДенежныхСредств/ТипДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
</mdclass:Enum>

powerfull/src/Documents/РеализацияАбонементов/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Наименование;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаАбонементов 
	Движения.ПродажаАбонементов.Записывать = Истина;
	Для Каждого ТекСтрокаПродажаАбонементов Из ПродажаАбонементов Цикл
		Движение = Движения.ПродажаАбонементов.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Абонемент = ТекСтрокаПродажаАбонементов.Абонемент;
		Движение.Цена = ТекСтрокаПродажаАбонементов.Цена;
	КонецЦикла;

	// регистр ДеньгиОтПродажиУслугИАбонементов Приход
	Движения.ДеньгиОтПродажиУслугИАбонементов.Записывать = Истина;
	Движение = Движения.ДеньгиОтПродажиУслугИАбонементов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(ТипОплаты);
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(ТипОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Оплата.Наличные, Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.Оплата.Карта, Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[ТипОплаты];
КонецФункции
